<!-- dflook/terraform-github-actions {"workspace":"default","backend":"d70ba099d2f2def7688622280262083c8e2e5fc70053e61a4f0af32412bbc98a","backend_type":"azurerm"} -->
Terraform plan in __.__
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cassandra.module.cassandra.data.external.cassandra will be read during apply
  # (config refers to values not yet known)
 <= data "external" "cassandra"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "/tmp/terraform-data-dir/modules/cassandra.cassandra/scripts/cassandra_config.sh",
        ]
      + query   = {
          + "cluster_name"      = "cassandra-cl"
          + "resource_group"    = "cassandra-rg"
          + "subscription_name" = "Microsoft Partner Network"
          + "tenant_id"         = "************************************"
        }
      + result  = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_cosmosdb_cassandra_cluster.this will be created
  + resource "azurerm_cosmosdb_cassandra_cluster" "this" {
      + authentication_method          = "Cassandra"
      + default_admin_password         = (sensitive value)
      + delegated_management_subnet_id = "*********************************************************************************************************************************************************"
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "cassandra-cl"
      + repair_enabled                 = true
      + resource_group_name            = "cassandra-rg"
      + version                        = "3.11"

      + timeouts {
          + create = "60m"
          + delete = "60m"
        }
    }

  # module.cassandra.module.cassandra.azurerm_cosmosdb_cassandra_datacenter.this will be created
  + resource "azurerm_cosmosdb_cassandra_datacenter" "this" {
      + availability_zones_enabled     = false
      + cassandra_cluster_id           = (known after apply)
      + delegated_management_subnet_id = "*********************************************************************************************************************************************************"
      + disk_count                     = 4
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "cassandra-cl-dc"
      + node_count                     = 3
      + sku_name                       = "Standard_D8s_v4"

      + timeouts {
          + create = "60m"
          + delete = "60m"
        }
    }

  # module.cassandra.module.cassandra.azurerm_lb.this will be created
  + resource "azurerm_lb" "this" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "cassandra-cl-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "cassandra-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "PrivateIPAddress"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.1.0.100"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "*********************************************************************************************************************************************************"
        }
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool.this will be created
  + resource "azurerm_lb_backend_address_pool" "this" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "cassandra-cl-nodes"
      + outbound_rules            = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[0] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + name                    = "node-1"
      + virtual_network_id      = "*****************************************************************************************************************************************"
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[1] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + name                    = "node-2"
      + virtual_network_id      = "*****************************************************************************************************************************************"
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[2] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + name                    = "node-3"
      + virtual_network_id      = "*****************************************************************************************************************************************"
    }

  # module.cassandra.module.cassandra.azurerm_lb_probe.this will be created
  + resource "azurerm_lb_probe" "this" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "cassandra"
      + number_of_probes    = 2
      + port                = 9042
      + protocol            = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_rule.this will be created
  + resource "azurerm_lb_rule" "this" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 9042
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "PrivateIPAddress"
      + frontend_port                  = 9042
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "cassandra"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.cassandra.module.cassandra.azurerm_role_assignment.this will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "************************************"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/02b44a0d-f98e-407e-b0c1-7d394305857e/resourceGroups/nonprod-infra/providers/Microsoft.Network/virtualNetworks/nonprod-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [terraform #1](https://github.com/hybridaccess/nonprod-test-infra/actions/runs/2509458114)